freind = 'Максим'

first_letter = freind[0]
print("Первая буква имени друга", first_letter)

print("Вторая буква имени друга", first_letter[1])

# [-1] начёт буквы с конца
# если использовать [start:end] или [0:4] он будет
# показывать с какого по  какое

# len(freind) - Длина строки (Скольки в ней символов)
# freind.fint('a') - ищем символ 'a' в строке
# freind.split() - разбиение строки через  проблем
# freind.isdigit()  строка состоит из чисел
# freind.upper() - приведение строки к верхнему регистру
# freind.lower() - приведение строки к нижнему регистру

